atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/gpio_driver.c
static term gpiodriver_read(Context *ctx, term cmd)
{
    term gpio_num = term_get_tuple_element(cmd, 1);
    term result = gpio_digital_read(ctx, gpio_num);
    if (UNLIKELY(result == BADARG_ATOM)) {
        return error_tuple_maybe_gc(ctx, result);
    }
    return result;
}

static bool gpiodriver_is_gpio_attached(struct GPIOData *gpio_data, int gpio_num)
{
    struct ListHead *item;
    LIST_FOR_EACH (item, &gpio_data->gpio_listeners) {
        struct GPIOListenerData *gpio_listener = GET_LIST_ENTRY(item, struct GPIOListenerData, gpio_listener_list_head);
        if (gpio_listener->gpio == gpio_num) {
            return true;
        }
    }
    return false;
}

static term unregister_interrupt_listener(Context *ctx, gpio_num_t gpio_num)
{
    struct GPIOData *gpio_data = ctx->platform_data;
    struct ListHead *item;
    struct ListHead *tmp;
    MUTABLE_LIST_FOR_EACH (item, tmp, &gpio_data->gpio_listeners) {
        struct GPIOListenerData *gpio_listener = GET_LIST_ENTRY(item, struct GPIOListenerData, gpio_listener_list_head);
        if (gpio_listener->gpio == gpio_num) {
            sys_unregister_listener(ctx->global, &gpio_listener->listener);
            list_remove(&gpio_listener->gpio_listener_list_head);
            free(gpio_listener);

            gpio_set_intr_type(gpio_num, GPIO_INTR_DISABLE);
            gpio_isr_handler_remove(gpio_num);

            if (list_is_empty(&gpio_data->gpio_listeners)) {
                gpio_uninstall_isr_service();
            }

            return OK_ATOM;
        }
    }

    return error_tuple_maybe_gc(ctx, BADARG_ATOM);
}

static term gpiodriver_set_int(Context *ctx, int32_t target_pid, term cmd)
{
    GlobalContext *glb = ctx->global;
    int32_t target_local_pid;

    struct GPIOData *gpio_data = ctx->platform_data;

    term gpio_num_term = term_get_tuple_element(cmd, 1);
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        int32_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return error_tuple_maybe_gc(ctx, BADARG_ATOM);
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return error_tuple_maybe_gc(ctx, BADARG_ATOM);
    }

    term trigger = term_get_tuple_element(cmd, 2);
    if (term_get_tuple_arity(cmd) == 4) {
        term pid = term_get_tuple_element(cmd, 3);
        if (UNLIKELY(!term_is_pid(pid) && !term_is_atom(pid))) {
            ESP_LOGE(TAG, "Invalid listener parameter, must be a pid() or registered process!");
            return error_tuple_maybe_gc(ctx, BADARG_ATOM);
        }
        if (term_is_pid(pid)) {
            target_local_pid = term_to_local_process_id(pid);
        } else {
            int pid_atom_index = term_to_atom_index(pid);
            int32_t registered_process = (int32_t) globalcontext_get_registered_process(ctx->global, pid_atom_index);
            if (UNLIKELY(registered_process == 0)) {
                ESP_LOGE(TAG, "Invalid listener parameter, atom() is not a registered process name!");
                return error_tuple_maybe_gc(ctx, BADARG_ATOM);
            }
            target_local_pid = registered_process;
        }
    } else {
        target_local_pid = target_pid;
    }


    /* TODO: GPIO specific atoms should be removed from platform_defaultatoms and constructed within this driver */
    gpio_int_type_t interrupt_type = interop_atom_term_select_int(int_trigger_table, trigger, ctx->global);
    if(UNLIKELY(interrupt_type == GPIO_INTR_MAX)) {
        return error_tuple_maybe_gc(ctx, BADARG_ATOM);
    }

    if (trigger != NONE_ATOM) {
        if (UNLIKELY(gpiodriver_is_gpio_attached(gpio_data, gpio_num))) {
            ESP_LOGE(TAG, "Pin %i already attached to interrupt", gpio_num);
            return error_tuple_maybe_gc(ctx, BADARG_ATOM);
        }

        TRACE("going to install interrupt for %i.\n", gpio_num);

        if (list_is_empty(&gpio_data->gpio_listeners)) {
            gpio_install_isr_service(0);
            TRACE("installed ISR service 0.\n");
        }

        struct GPIOListenerData *data = malloc(sizeof(struct GPIOListenerData));
        if (IS_NULL_PTR(data)) {
            ESP_LOGE(TAG, "gpiodriver_set_int: Failed to ensure free heap space.");
            return error_tuple_maybe_gc(ctx, OUT_OF_MEMORY_ATOM);
        }
        list_append(&gpio_data->gpio_listeners, &data->gpio_listener_list_head);
        data->gpio = gpio_num;
        data->target_local_pid = target_local_pid;
        sys_register_listener(glb, &data->listener);
        data->listener.sender = data;
        data->listener.handler = gpio_interrupt_callback;

        // These inputs have already been validated, so any errors indicate a bad state or internal error.
        esp_err_t ret = gpio_set_direction(gpio_num, GPIO_MODE_INPUT);
        if (UNLIKELY(ret != ESP_OK)) {
            return error_tuple_maybe_gc(ctx, globalcontext_make_atom(ctx->global, ATOM_STR("\xF", "direction_state")));
        }
        ret = gpio_set_intr_type(gpio_num, interrupt_type);
        if (UNLIKELY(ret != ESP_OK)) {
            return error_tuple_maybe_gc(ctx, globalcontext_make_atom(ctx->global, ATOM_STR("\xF", "interrupt_state")));
        }
        ret = gpio_isr_handler_add(gpio_num, gpio_isr_handler, data);
        if (UNLIKELY(ret != ESP_OK)) {
            return error_tuple_maybe_gc(ctx, globalcontext_make_atom(ctx->global, ATOM_STR("\xD", "handler_state")));
        }
    } else {
        if (UNLIKELY(!gpiodriver_is_gpio_attached(gpio_data, gpio_num))) {
            return error_tuple_maybe_gc(ctx, BADARG_ATOM);
        }
        gpio_set_intr_type(gpio_num, interrupt_type);
        return unregister_interrupt_listener(ctx, gpio_num);
    }

    return OK_ATOM;
}

static term gpiodriver_remove_int(Context *ctx, term cmd)
{
    term gpio_num_term = term_get_tuple_element(cmd, 1);
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        int32_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return error_tuple_maybe_gc(ctx, BADARG_ATOM);
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return error_tuple_maybe_gc(ctx, BADARG_ATOM);
    }


